In [1]:
!pip install pandas

Requirement already satisfied: pandas in /home/shailesh/Desktop/VritEducation/.vritenv/lib/python3.10/site-packages (2.2.2)
Requirement already satisfied: tzdata>=2022.7 in /home/shailesh/Desktop/VritEducation/.vritenv/lib/python3.10/site-packages (from pandas) (2024.1)
Requirement already satisfied: pytz>=2020.1 in /home/shailesh/Desktop/VritEducation/.vritenv/lib/python3.10/site-packages (from pandas) (2024.2)
Requirement already satisfied: numpy>=1.22.4 in /home/shailesh/Desktop/VritEducation/.vritenv/lib/python3.10/site-packages (from pandas) (2.1.1)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/shailesh/Desktop/VritEducation/.vritenv/lib/python3.10/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: six>=1.5 in /home/shailesh/Desktop/VritEducation/.vritenv/lib/python3.10/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [3]:
import pandas as pd
import numpy as np

In [4]:
pd.__version__

'2.2.2'

## Datatype of Pandas

1. DataFrame : 2D Table with rows and columns

2. Series : 1D array-like , can hold any data type such as integers, strings, floating-point numbers, and Python objects

## Creating DataFrame

In [5]:
data = {
    "name":["Bob","charlie","Madhu"],
    "age":[25, 30, 35]
}

In [7]:
df = pd.DataFrame(data)

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
df

      name  age
0      Bob   25
1  charlie   30
2    Madhu   35

In [11]:
list_data = np.array([["bob", 25],['Charlie',30],["madhu", 35]])

In [29]:
df = pd.DataFrame(list_data, columns = ["name", "age"], index = ["a","b","c"])

In [30]:
df

      name age
a      bob  25
b  Charlie  30
c    madhu  35

## Reading Data From Files

- `pd.read_csv(file_path, delimiter=',')`: Reads CSV (Comma Separated Value) file and returns a Pandas DataFrame
    - *file_path*: Path to csv file
    - *delimiter*: Symbol separating different columns (default=',')

In [53]:
titanic_df = pd.read_csv("Titanic_data.csv", nrows = 100)

In [54]:
type(titanic_df)

pandas.core.frame.DataFrame

In [55]:
titanic_df.shape

(100, 12)

In [25]:
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

## Accessing Data

In [32]:
names = titanic_df['Name']
# names = titanic_df.Fare

In [47]:
names.head(3)

0     7.2500
1    71.2833
2     7.9250
Name: Fare, dtype: float64

In [33]:
type(names)

pandas.core.series.Series

In [41]:
name_age = titanic_df[['Name', "Age"]]

In [44]:
name_age.head(3)

                                                Name   Age
0                            Braund, Mr. Owen Harris  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0

In [43]:
type(name_age)

pandas.core.frame.DataFrame

In [50]:
titanic_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [51]:
titanic_df.shape

(891, 12)